In [2]:
import pandas as pd

In [9]:
data = {
    'a':[2, 4, 6],
    'b':[3, 6, 9],
    'c':[4, 8, 12]    
}

In [11]:
df = pd.DataFrame(data,index =[10, 20, 30] )
df

    a  b   c
10  2  3   4
20  4  6   8
30  6  9  12

In [16]:
df1 = pd.Series(
    [[1, 2, 3],
    [4, 5, 6]])
df1

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [22]:
df= (pd.melt(df))

In [24]:
df = (pd.melt(df))
df

D:\win_python\WPy64-3850\python-3.8.5.amd64\lib\site-packages\IPython\core\interactiveshell.py:3417: FutureWarning: This dataframe has a column name that matches the 'value_name' column name of the resultiing Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.
  exec(code_obj, self.user_global_ns, self.user_ns)

    variable value
0   variable     a
1   variable     a
2   variable     a
3   variable     b
4   variable     b
5   variable     b
6   variable     c
7   variable     c
8   variable     c
9      value     2
10     value     4
11     value     6
12     value     3
13     value     6
14     value     9
15     value     4
16     value     8
17     value    12